{
  "title": "Sessions",
  "description": "Sessions of DevFest Montreal 2025",
  "sessions": [
    {
      "title": "Doors open (please bring your ID) and Breakfast",
      "uuid": "246a17da-adf9-4d8e-9c50-ef84bdf68c55",
      "description": "Enjoy the breakfast and network with other attendees",
      "speakerUUID": [],
      "isSpecialEvent": true,
      "icon": "registration",
      "tags": [
        "DevFestMTL",
        "Networking",
        "Welcome"
      ]
    },
    {
      "title": "Keynote",
      "uuid": "4d0cb762-4de4-43cf-b4ea-f02bcfa5b559",
      "description": "Welcome message and introduction to the event",
      "speakerUUID": [
        "f47ac10b-58cc-4372-a567-0e02b2c3d479"
      ],
      "isSpecialEvent": true,
      "icon": "keynote",
      "tags": [
        "DevFestMTL",
        "Keynote",
        "Opening"
      ]
    },
    {
      "title": "Talks, Workshops and Demos (Cloud, IA, ML, Web, Android & Flutter...)",
      "uuid": "d0c327de-afcc-41a4-a161-a82d0387ec86",
      "description": "Join us in the other room for captivating talks and inspiring discussions!",
      "speakerUUID": [],
      "tags": [
        "DevFestMTL",
        "Talks",
        "Workshops"
      ]
    },
    {
      "title": "VIP Demos (Limited seating)",
      "uuid": "468a0ecd-2ad1-4b52-8778-a5c0392b7808",
      "description": "See things in action in these limited (up to 10 people) demos in one of our breakout rooms",
      "speakerUUID": [],
      "tags": [
        "DevFestMTL",
        "Demos",
        "AI"
      ]
    },
    {
      "title": "Career Coaching 1:1",
      "uuid": "2ea23aa0-28a6-4401-844f-039b2d879df2",
      "description": "Get to chat for 15-20 mins with a seasoned professional and unlock your full potential!",
      "speakerUUID": [
        "f47ac10b-58cc-4372-a567-0e02b2c3d479",
        "85a9290e-5306-4887-9b7f-9234361f8b47",
        "11bc74f2-75c1-4d59-a347-16ced19db81f"
      ],
      "rsvpLink": "https://forms.gle/h1WUsausyuwRCT8r8",
      "rsvpButtonText": "RSVP Here",
      "tags": [
        "Career",
        "Mentorship",
        "Coaching",
        "Networking"
      ]
    },
    {
      "title": "Lunch & Raffle",
      "uuid": "27ff7729-5792-4efd-a813-321fd6523e63",
      "description": "Enjoy a delicious lunch, network with other attendees, and don't miss your chance to participate in our lunchtime raffle with exciting prizes!",
      "speakerUUID": [],
      "isSpecialEvent": true,
      "icon": "lunch",
      "tags": [
        "DevFestMTL",
        "Lunch",
        "Networking"
      ]
    },
    {
      "title": "Talks, Workshops and Demos (Cloud, IA, ML, Web, Android & Flutter...)",
      "uuid": "1d568a65-80e4-4531-a2f4-23ca2cb28986",
      "description": "Join us in the other room for captivating talks and inspiring discussions!",
      "speakerUUID": [],
      "tags": [
        "DevFestMTL",
        "Talks",
        "Workshops"
      ]
    },
    {
      "title": "Closing Note",
      "uuid": "949819b7-15db-40ce-9cb8-abbcf5d44d90",
      "description": "Raffle prizes and closing remarks",
      "speakerUUID": [
        "f47ac10b-58cc-4372-a567-0e02b2c3d479"
      ],
      "isSpecialEvent": true,
      "icon": "raffles",
      "tags": [
        "DevFestMTL",
        "Closing",
        "Raffles",
        "Networking"
      ]
    },
    {
      "title": "Build With AI - Build Your First AI Agent",
      "uuid": "a1b2c3d4-e5f6-7890-1abc-2def3ghi4jkl",
      "description": "Tired of AI agent theory? Ready to actually build something? In this interactive session, we'll forget the slides and jump straight into the code. This isn't a lecture. It's a launchpad. Let's build.",
      "shortDescription": "A deep, guided session where Kiruthika leads participants in a hands-on lab to build a complete AI Agent solution from scratch using Google's ADK Toolkit.",
      "speakerUUID": [
        "d111b534-6acd-4631-a6d6-f8aa190f4ff8"
      ],
      "tags": [
        "AI",
        "Agents",
        "ADK",
        "GoogleAI",
        "Workshop",
        "CodeLab"
      ],
      "rsvpLink": "https://forms.gle/7dshs6GFnMQikSej7",
      "rsvpButtonText": "RSVP Here"
    },
    {
      "title": "AI Filmmaking Workshop: Create Your First Movie with Gemini and Veo",
      "uuid": "0eaf3eb4-4ee1-44fc-afb3-b3a5733a6db0",
      "description": "Join Filmmaker and AI Google Developer Expert Kevin Blanco to create a complete short film using Google's AI tools. Learn professional storytelling techniques while building scenes with Gemini and Veo.",
      "shortDescription": "Kevin Blanco will create a complete short film using Google's AI tools. Learn professional storytelling techniques while building scenes with Gemini and Veo.",
      "speakerUUID": [
        "8a5c02f9-0df6-4f1f-8c00-8a4d1ec559f3"
      ],
      "tags": [
        "AI",
        "Gemini",
        "Veo",
        "GenAI",
        "Filmmaking",
        "Workshop"
      ],
      "rsvpLink": "https://forms.gle/62tF8rk5navH8JM5A",
      "rsvpButtonText": "RSVP Here"
    },
    {
      "title": "Gemini CLI Workshop with Firebase Studio",
      "uuid": "5118f1ca-242f-4a7b-b2d8-ec9aec84ea4f",
      "description": "Unleash AI in your workflow! In this hands-on workshop, you'll use the Gemini CLI within Firebase Studio to rapidly build an application, covering everything from generating boilerplate to deploying on Google Cloud.",
      "shortDescription": "You will use the Gemini within Firebase Studio to rapidly build an application.",
      "speakerUUID": [
        "a547eadd-620e-4dbb-b40c-88bfd3c52555"
      ],
      "tags": [
        "AI",
        "Gemini",
        "CLI",
        "Firebase",
        "Cloud",
        "Workshop"
      ],
      "rsvpLink": "https://forms.gle/3d1ULFpsxUnzMf5s6",
      "rsvpButtonText": "RSVP Here"
    },
    {
      "title": "The Digital Mirror: A Deep Dive into AI, Ethics, and Creative Responsibility",
      "uuid": "9617acf7-cd07-4f55-9f9b-5cf2efaa2b14",
      "description": "In an age of powerful generative AI, what does it mean to be a creator? This workshop goes beyond the hype to explore the ethical implications of tools like Google's VEO, Imagen, and Gemini. You'll engage in a hands-on design challenge, using these platforms to prototype characters and environments rapidly—but the focus will be on critical reflection. We'll discuss responsible sourcing, copyright, bias in datasets, and the future of human creativity.",
      "shortDescription": "A hands-on workshop on AI ethics using Google’s VEO, Imagen, and Gemini to design and reflect on creativity and responsibility.",
      "speakerUUID": [
        "85a9290e-5306-4887-9b7f-9234361f8b47"
      ],
      "tags": [
        "AI",
        "Ethics",
        "GenAI",
        "VEO",
        "Imagen",
        "ResponsibleAI"
      ],
      "rsvpLink": "https://forms.gle/ff75a87HoY4QRhrG6",
      "rsvpButtonText": "RSVP Here"
    },
    {
      "title": "From Code to Enterprise: An Introduction to Gemini Enterprise and ADK",
      "uuid": "14ce2d86-d3fc-472e-95dd-013609bea9e7",
      "description": "From code to enterprise: Build a simple AI agent live using the ADK and take full advantage of its capabilities in Google Enterprise. We’ll show you how to break down data silos, connect to various sources, and scale from a single agent to a full solution to unlock real, AI-powered productivity.",
      "shortDescription": "Build a live AI agent with Google Enterprise and ADK, connecting data sources to boost enterprise productivity.",
      "speakerUUID": [
        "55bd36ad-233a-4742-bd6c-7677e986fb5c",
        "2a9739f3-e2ba-4c91-8dfc-ca7c1650d477"
      ],
      "tags": [
        "AI",
        "Agents",
        "ADK",
        "Enterprise",
        "Cloud"
      ]
    },
    {
      "title": "Beyond the Spotlight: Building Data & Web Agents at Cirque du Soleil",
      "uuid": "0e0843fa-103a-4f37-96eb-6c3a3251f57e",
      "description": "Cirque du Soleil is known worldwide for its shows, but behind the scenes, we’re reinventing how teams and audiences interact with data. In this session, we’ll share how we built two production-ready agents, one for internal use, one for our website, using Google’s Agent Developer Kit and Agent Engine.",
      "shortDescription": "Cirque du Soleil built two data agents—one for internal use, one for their website—using Google’s Agent Developer Kit and Agent Engine to improve team and audience data interaction.",
      "speakerUUID": [
        "c434ed68-b98b-476c-9258-73f410797337",
        "6e699ed5-2bca-431c-919d-b26c17d14f46",
        "2ad81bc9-aceb-4ce2-b1c6-71a250bc6d36",
        "7a98ac81-6b7d-483a-aa57-5de5f8447c75"
      ],
      "tags": [
        "Web",
        "AI",
        "Data",
        "Agents",
        "ADK"
      ]
    },
    {
      "title": "Can AI do reverse engineering ?",
      "uuid": "33a3d979-100f-4f55-b516-f402a836929d",
      "description": "This talk explores the challenging field of reverse engineering, the process of figuring out what uncommented, complex, mystery code does. Traditionally a difficult, human-intensive task, the talk questions the emerging promise of AI to automate and outperform human engineers in this domain.",
      "shortDescription": "This talk questions if AI can automate reverse engineering of complex, uncommented code—a task that’s usually difficult and done by humans.",
      "speakerUUID": [
        "148610e9-05d7-4058-8dcf-691d753342c3"
      ],
      "tags": [
        "AI",
        "Security",
        "Engineering",
        "Code",
        "Automation"
      ]
    },
    {
      "title": "Building the Chain of Trust: A Google ADK Blueprint for Grounded Legal AI Agen",
      "uuid": "f86aabac-12d6-4181-a54c-5dca0ee33430",
      "description": "Transform unreliable AI into trustworthy legal assistants. Learn to build a “Chain of Trust” using Google ADK + Vertex AI Search + Cloud Run + Flutter to eliminate hallucinations and prove every AI claim with verifiable sources.",
      "shortDescription": "Make AI reliable for legal work: Use Google ADK, Vertex AI, Cloud Run, and Flutter to verify every claim with real sources and stop hallucinations.",
      "speakerUUID": [
        "b177a43f-039a-4a41-a285-e3fa82bb0d71"
      ],
      "tags": [
        "AI",
        "ADK",
        "VertexAI",
        "Cloud",
        "Flutter",
        "LegalTech"
      ]
    },
    {
      "title": "Gemini with ServiceNow: An Example of LLM Usage in Enterprise Workflows",
      "uuid": "c4c44c28-b703-4aae-b4c4-3f39efc6b210",
      "description": "The conversation around AI and Large Language Models (LLMs) often centers on consumer applications, but their true power lies in transforming enterprise operations. In this session, we’ll move past the theory and dive into practical, real-world use cases for AI and LLMs within the ServiceNow platform.",
      "shortDescription": "Discover how AI and LLMs transform enterprise operations, with hands-on ServiceNow platform use cases—not just consumer applications.",
      "speakerUUID": [
        "11bc74f2-75c1-4d59-a347-16ced19db81f"
      ],
      "tags": [
        "AI",
        "Gemini",
        "LLM",
        "Enterprise",
        "Web",
        "ServiceNow"
      ]
    },
    {
      "title": "Talk #1",
      "uuid": "25547863-876f-4a20-9fb1-3df31b6be169",
      "description": "Talk #1",
      "shortDescription": "Talk #1",
      "speakerUUID": [],
      "tags": []
    },
    {
      "title": "Agentic AI for Legacy Inventory Modernization: Building a Universal Data Schem",
      "uuid": "f4af3d18-5f08-44cf-b67e-4b688d7a28b8",
      "description": "Unlock seamless digital transformation with our universal data schema and AI-powered migration agent standardize and automate asset integration, delivering real-time analytics and rapid legacy decommissioning, future-proof your operations today!",
      "shortDescription": "Universal data schema and AI agent automate asset integration and analytics for quick digital transformation.",
      "speakerUUID": [
        "6679e097-7eaf-443c-bc37-5348284dc517",
        "09770b99-ff7e-430f-9d26-bb752753613e"
      ],
      "tags": [
        "AI",
        "Agents",
        "Data",
        "Modernization",
        "Enterprise"
      ]
    },
    {
      "title": "Inside Mobile Development Frameworks",
      "uuid": "b5c2421b-e7b4-48f7-b0b1-befaf20c7d44",
      "description": "React Native, Flutter, .NET—how do they work behind the scenes? Explore the fundamentals and architectures that enable these frameworks to transform multi-platform code into native iOS and Android apps. Discover the magic behind features like hot reload, code push and Gemini Nano.",
      "shortDescription": "Learn how React Native, Flutter, and .NET turn one codebase into native apps, and how features like hot reload work.",
      "speakerUUID": [
        "1331b973-4f30-4f21-9942-072146e1713a"
      ],
      "tags": [
        "Android",
        "Mobile",
        "Flutter",
        "ReactNative",
        "iOS",
        "Gemini"
      ]
    },
    {
      "title": "Perfetto on a Budget: Optimizing Android Performance on Low-End Hardware",
      "uuid": "183e7f47-5a72-4cc4-b90f-89c2bb779c94",
      "description": "Low-end devices often present the toughest performance challenges, where every CPU cycle and megabyte of memory counts. When conventional profiling falls short, Perfetto offers deep system visibility required to diagnose complex bottlenecks, excessive memory pressure, or unexpected I/O contention",
      "shortDescription": "Perfetto helps diagnose performance problems on low-end devices when normal profiling fails.",
      "speakerUUID": [
        "3130c533-0ac5-432d-b30c-922afa98ba64"
      ],
      "tags": [
        "Android",
        "Performance",
        "Mobile",
        "Debugging",
        "Perfetto"
      ]
    },
    {
      "title": "Smart Persona: Accelerating Consumer Insights with Synthetic Personas",
      "uuid": "750ffce5-5eac-4df8-96c5-6dfc850fb158",
      "description": "We aim to transform consumer research with AI-powered synthetic personas! Replace expensive research interviews with realistic digital consumers who provide instant, consistent insights 24/7. See how multi-node AI architecture achieves 90%+ accuracy in simulating real consumer behavior.",
      "shortDescription": "AI-powered synthetic personas replace costly interviews by simulating real consumer insights with 90%+ accuracy.",
      "speakerUUID": [
        "29b9deee-7ade-4ca8-b7e7-eb0fdd9d81a4"
      ],
      "tags": [
        "AI",
        "Personas",
        "UX",
        "Research",
        "Data"
      ]
    },
    {
      "title": "Human Computer Interaction: The UX of AI",
      "uuid": "d12aa6ca-81ff-4123-989e-bf7d21ae7464",
      "description": "Why is it so hard to talk to AI? It’s not you, it’s the language. I’ll share humorous examples of human miscommunication to illustrate why ‘natural language’ doesn’t translate as you’d expect, and what we can do to address the issue.",
      "shortDescription": "This talk humorously explores why human-AI communication is challenging, using real-world miscommunication examples to show how natural language often fails—and offering ways to improve how we talk to AI.",
      "speakerUUID": [
        "5f8735c9-9ca8-42c3-b902-dfcd11dc9252"
      ],
      "tags": [
        "AI",
        "UX",
        "HCI",
        "Design",
        "NLP"
      ]
    },
    {
      "title": "Live Model Fine-Tuning: Customizing Gemma 3 270M in Under 40 Minutes",
      "uuid": "71f0abc9-de35-46dc-a93a-ca8420dd8213",
      "description": "Witness the power of accessible AI as we fine-tune Google's new Gemma 3 270M model live on stage in under 40 minutes. This demo focuses on post-training customization, showcasing how a powerful pre-trained model can be rapidly adapted for a specialized task. To achieve this within the time limit, we will leverage the Unsloth library's remarkable speed and efficiency for Parameter-Efficient Fine-Tuning (PEFT) with LoRA, all within a standard Google Colab environment. This is a practical, step-by-step demonstration with no slides—just code and results.",
      "shortDescription": "See a live demo fine-tuning Google’s Gemma 3 270M AI model for a custom task in under 40 minutes—just code, no slides—using Unsloth and LoRA in Google Colab.",
      "speakerUUID": [
        "d86fde6f-7994-4fe5-821b-9e8b622f90c8"
      ],
      "tags": [
        "AI",
        "Gemma",
        "FineTuning",
        "LLM",
        "GenAI",
        "LiveDemo"
      ],
      "rsvpLink": "https://forms.gle/QyH9v2KXw9AL7cCE8",
      "rsvpButtonText": "RSVP Here"
    },
    {
      "title": "Supercharging Flutter Apps with AI: Automating Workflows with n8n and Gemini",
      "uuid": "82294d89-8826-45aa-a965-4eafc71c5ec7",
      "description": "Building modern apps isn’t just about beautiful UIs — it’s about making them smarter and more automated. Thanks to AI (Gemini) and workflow automation (n8n), Flutter developers can now add intelligence and real-time automation to their apps without having to reinvent the wheel.",
      "shortDescription": "Flutter devs can now use AI (Gemini) and n8n to make apps smarter and automate tasks easily—no need to build everything from scratch.",
      "speakerUUID": [
        "d3c0ffd5-811d-4923-ba2d-f5a10c18cd7b"
      ],
      "tags": [
        "AI",
        "Flutter",
        "Mobile",
        "Android",
        "Gemini",
        "Automation"
      ],
      "rsvpLink": "https://forms.gle/DLkWST7CGCV9gwcB9",
      "rsvpButtonText": "RSVP Here"
    },
    {
      "title": "Build AI for the Real World with Gemma",
      "uuid": "0b5a7e21-636b-41b1-b7a5-56b12309f56a",
      "description": "Unlock Google's most powerful open source AI! In this workshop, you'll get hands-on with the Gemma family of models to build a real-world application, learning how to run powerful AI on your own laptop.",
      "shortDescription": "Hands-on workshop: Build real apps with Google’s Gemma AI models on your own laptop.",
      "speakerUUID": [
        "bce0f861-ab51-4d08-8560-c1a942f11ced"
      ],
      "tags": [
        "AI",
        "Gemma",
        "Workshop",
        "LLM",
        "OpenSource"
      ],
      "rsvpLink": "https://forms.gle/c4Vz5rNfhNtMuB2D9",
      "rsvpButtonText": "RSVP Here"
    }
  ]
}

