{
  "title": "Sessions",
  "description": "Sessions du DevFest Montréal 2025",
  "sessions": [
    {
      "title": "Ouverture des portes (veuillez apporter votre pièce d'identité) et petit-déjeuner",
      "uuid": "246a17da-adf9-4d8e-9c50-ef84bdf68c55",
      "description": "Profitez du petit-déjeuner et réseautez avec les autres participants.",
      "speakerUUID": [],
      "isSpecialEvent": true,
      "icon": "registration",
      "tags": [
        "DevFestMTL",
        "Networking",
        "Welcome"
      ]
    },
    {
      "title": "Discours d'ouverture",
      "uuid": "4d0cb762-4de4-43cf-b4ea-f02bcfa5b559",
      "description": "Message de bienvenue et présentation de l'événement.",
      "speakerUUID": [
        "f47ac10b-58cc-4372-a567-0e02b2c3d479"
      ],
      "isSpecialEvent": true,
      "icon": "keynote",
      "tags": [
        "DevFestMTL",
        "Keynote",
        "Opening"
      ]
    },
    {
      "title": "Conférences, ateliers et démos (Cloud, IA, ML, Web, Android & Flutter...)",
      "uuid": "d0c327de-afcc-41a4-a161-a82d0387ec86",
      "description": "Rejoignez-nous dans l'autre salle pour des conférences captivantes et des discussions inspirantes !",
      "speakerUUID": [],
      "tags": [
        "DevFestMTL",
        "Talks",
        "Workshops"
      ]
    },
    {
      "title": "Démos VIP (places limitées)",
      "uuid": "468a0ecd-2ad1-4b52-8778-a5c0392b7808",
      "description": "Voyez les choses en action lors de ces démos limitées (jusqu'à 10 personnes) dans l'une de nos salles de réunion.",
      "speakerUUID": [],
      "tags": [
        "DevFestMTL",
        "Demos",
        "AI"
      ]
    },
    {
      "title": "Coaching de carrière 1:1",
      "uuid": "2ea23aa0-28a6-4401-844f-039b2d879df2",
      "description": "Discutez pendant 15 à 20 minutes avec un professionnel chevronné et libérez votre plein potentiel !",
      "speakerUUID": [
        "f47ac10b-58cc-4372-a567-0e02b2c3d479",
        "85a9290e-5306-4887-9b7f-9234361f8b47",
        "11bc74f2-75c1-4d59-a347-16ced19db81f",
        "d3c0ffd5-811d-4923-ba2d-f5a10c18cd7b"
      ],
      "rsvpLink": "https://forms.gle/h1WUsausyuwRCT8r8",
      "rsvpButtonText": "S'inscrire ici",
      "tags": [
        "Career",
        "Mentorship",
        "Coaching",
        "Networking"
      ]
    },
    {
      "title": "Dîner & Tirage",
      "uuid": "27ff7729-5792-4efd-a813-321fd6523e63",
      "description": "Profitez d’un délicieux dîner, réseauter avec les autres participants et ne manquez pas votre chance de participer à notre tirage du midi pour gagner des prix excitants!",
      "speakerUUID": [],
      "isSpecialEvent": true,
      "icon": "lunch",
      "tags": [
        "DevFestMTL",
        "Lunch",
        "Networking"
      ]
    },
    {
      "title": "Conférences, ateliers et démos (Cloud, IA, ML, Web, Android & Flutter...)",
      "uuid": "1d568a65-80e4-4531-a2f4-23ca2cb28986",
      "description": "Rejoignez-nous dans l'autre salle pour des conférences captivantes et des discussions inspirantes !",
      "speakerUUID": [],
      "tags": [
        "DevFestMTL",
        "Talks",
        "Workshops"
      ]
    },
    {
      "title": "Mot de la fin",
      "uuid": "949819b7-15db-40ce-9cb8-abbcf5d44d90",
      "description": "Tirage au sort et remarques de clôture.",
      "speakerUUID": [
        "f47ac10b-58cc-4372-a567-0e02b2c3d479"
      ],
      "isSpecialEvent": true,
      "icon": "raffles",
      "tags": [
        "DevFestMTL",
        "Closing",
        "Raffles",
        "Networking"
      ]
    },
    {
      "title": "Construisez avec l'IA - Créez votre premier agent IA",
      "uuid": "a1b2c3d4-e5f6-7890-1abc-2def3ghi4jkl",
      "description": "Fatigué de la théorie des agents IA ? Prêt à construire quelque chose de concret ? Dans cette session interactive, nous oublierons les diapositives et passerons directement au code. Ce n'est pas une conférence. C'est une rampe de lancement. Construisons.",
      "shortDescription": "Une session approfondie et guidée où Kiruthika accompagne les participants dans un laboratoire pratique pour construire une solution complète d'agent IA à partir de zéro en utilisant la boîte à outils ADK de Google.",
      "speakerUUID": [
        "d111b534-6acd-4631-a6d6-f8aa190f4ff8"
      ],
      "tags": [
        "AI",
        "Agents",
        "ADK",
        "GoogleAI",
        "Workshop",
        "CodeLab"
      ],
      "rsvpLink": "https://forms.gle/7dshs6GFnMQikSej7",
      "rsvpButtonText": "S'inscrire ici"
    },
    {
      "title": "Atelier de cinéma IA : Créez votre premier film avec Gemini et Veo",
      "uuid": "0eaf3eb4-4ee1-44fc-afb3-b3a5733a6db0",
      "description": "Rejoignez le cinéaste et expert développeur Google en IA, Kevin Blanco, pour créer un court métrage complet en utilisant les outils d'IA de Google. Apprenez des techniques de narration professionnelles tout en construisant des scènes avec Gemini et Veo.",
      "shortDescription": "Kevin Blanco créera un court métrage complet en utilisant les outils d'IA de Google. Apprenez des techniques de narration professionnelles tout en construisant des scènes avec Gemini et Veo.",
      "speakerUUID": [
        "8a5c02f9-0df6-4f1f-8c00-8a4d1ec559f3"
      ],
      "tags": [
        "AI",
        "Gemini",
        "Veo",
        "GenAI",
        "Filmmaking",
        "Workshop"
      ],
      "rsvpLink": "https://forms.gle/62tF8rk5navH8JM5A",
      "rsvpButtonText": "S'inscrire ici"
    },
    {
      "title": "Atelier Gemini CLI avec Firebase Studio",
      "uuid": "5118f1ca-242f-4a7b-b2d8-ec9aec84ea4f",
      "description": "Libérez l'IA dans votre flux de travail ! Dans cet atelier pratique, vous utiliserez le Gemini CLI dans Firebase Studio pour créer rapidement une application, de la génération du code de base au déploiement sur Google Cloud.",
      "shortDescription": "Vous utiliserez Gemini dans Firebase Studio pour créer rapidement une application.",
      "speakerUUID": [
        "a547eadd-620e-4dbb-b40c-88bfd3c52555"
      ],
      "tags": [
        "AI",
        "Gemini",
        "CLI",
        "Firebase",
        "Cloud",
        "Workshop"
      ],
      "rsvpLink": "https://forms.gle/3d1ULFpsxUnzMf5s6",
      "rsvpButtonText": "S'inscrire ici"
    },
    {
      "title": "Le miroir numérique : Une plongée en profondeur dans l'IA, l'éthique et la responsabilité créative",
      "uuid": "9617acf7-cd07-4f55-9f9b-5cf2efaa2b14",
      "description": "À l'ère de la puissante IA générative, que signifie être un créateur ? Cet atelier va au-delà du battage médiatique pour explorer les implications éthiques des outils comme VEO, Imagen et Gemini de Google. Vous participerez à un défi de conception pratique, en utilisant ces plateformes pour prototyper rapidement des personnages et des environnements, mais l'accent sera mis sur la réflexion critique. Nous discuterons de l'approvisionnement responsable, du droit d'auteur, des biais dans les ensembles de données et de l'avenir de la créativité humaine.",
      "shortDescription": "Un atelier pratique sur l'éthique de l'IA utilisant VEO, Imagen et Gemini de Google pour concevoir et réfléchir à la créativité et à la responsabilité.",
      "speakerUUID": [
        "85a9290e-5306-4887-9b7f-9234361f8b47"
      ],
      "tags": [
        "AI",
        "Ethics",
        "GenAI",
        "VEO",
        "Imagen",
        "ResponsibleAI"
      ],
      "rsvpLink": "https://forms.gle/ff75a87HoY4QRhrG6",
      "rsvpButtonText": "S'inscrire ici"
    },
    {
      "title": "Du code à l'entreprise : Une introduction à Gemini Enterprise et ADK",
      "uuid": "14ce2d86-d3fc-472e-95dd-013609bea9e7",
      "description": "Du code à l'entreprise : construisez un agent IA simple en direct à l'aide de l'ADK et profitez pleinement de ses capacités dans Google Agentspace. Nous vous montrerons comment décloisonner les données, vous connecter à diverses sources et passer d'un simple agent à une solution complète pour libérer une productivité réelle, alimentée par l'IA.",
      "shortDescription": "Construisez un agent IA en direct avec Google Enterpriseet ADK, en connectant des sources de données pour augmenter la productivité de l'entreprise.",
      "speakerUUID": [
        "55bd36ad-233a-4742-bd6c-7677e986fb5c",
        "2a9739f3-e2ba-4c91-8dfc-ca7c1650d477"
      ],
      "tags": [
        "AI",
        "Agents",
        "ADK",
        "Enterprise",
        "Cloud"
      ]
    },
    {
      "title": "Au-delà des projecteurs : Construire des agents de données et Web au Cirque du Soleil",
      "uuid": "0e0843fa-103a-4f37-96eb-6c3a3251f57e",
      "description": "Le Cirque du Soleil est connu dans le monde entier pour ses spectacles, mais en coulisses, nous réinventons la façon dont les équipes et le public interagissent avec les données. Dans cette session, nous partagerons comment nous avons construit deux agents prêts pour la production, l'un pour un usage interne, l'autre pour notre site Web, en utilisant le kit de développement d'agents et le moteur d'agents de Google.",
      "shortDescription": "Le Cirque du Soleil a construit deux agents de données — un pour un usage interne, un pour son site Web — en utilisant le kit de développement d'agents et le moteur d'agents de Google pour améliorer l'interaction des équipes et du public avec les données.",
      "speakerUUID": [
        "c434ed68-b98b-476c-9258-73f410797337",
        "6e699ed5-2bca-431c-919d-b26c17d14f46",
        "2ad81bc9-aceb-4ce2-b1c6-71a250bc6d36",
        "7a98ac81-6b7d-483a-aa57-5de5f8447c75"
      ],
      "tags": [
        "Web",
        "AI",
        "Data",
        "Agents",
        "ADK"
      ]
    },
    {
      "title": "L'IA peut-elle faire de la rétro-ingénierie ?",
      "uuid": "33a3d979-100f-4f55-b516-f402a836929d",
      "description": "Cette conférence explore le domaine difficile de la rétro-ingénierie, le processus consistant à comprendre ce que fait un code mystérieux, complexe et non commenté. Tâche traditionnellement difficile et à forte intensité humaine, la conférence remet en question la promesse émergente de l'IA d'automatiser et de surpasser les ingénieurs humains dans ce domaine.",
      "shortDescription": "Cette conférence se demande si l'IA peut automatiser la rétro-ingénierie de code complexe et non commenté, une tâche généralement difficile et effectuée par des humains.",
      "speakerUUID": [
        "148610e9-05d7-4058-8dcf-691d753342c3"
      ],
      "tags": [
        "AI",
        "Security",
        "Engineering",
        "Code",
        "Automation"
      ]
    },
    {
      "title": "Construire la chaîne de confiance : un modèle Google ADK pour un agent IA juridique fondé",
      "uuid": "f86aabac-12d6-4181-a54c-5dca0ee33430",
      "description": "Transformez une IA peu fiable en assistants juridiques dignes de confiance. Apprenez à construire une « chaîne de confiance » à l'aide de Google ADK + Vertex AI Search + Cloud Run + Flutter pour éliminer les hallucinations et prouver chaque affirmation de l'IA avec des sources vérifiables.",
      "shortDescription": "Rendez l'IA fiable pour le travail juridique : utilisez Google ADK, Vertex AI, Cloud Run et Flutter pour vérifier chaque affirmation avec des sources réelles et arrêter les hallucinations.",
      "speakerUUID": [
        "b177a43f-039a-4a41-a285-e3fa82bb0d71"
      ],
      "tags": [
        "AI",
        "ADK",
        "VertexAI",
        "Cloud",
        "Flutter",
        "LegalTech"
      ]
    },
    {
      "title": "Gemini avec ServiceNow : Un exemple d'utilisation de LLM dans les flux de travail d'entreprise",
      "uuid": "c4c44c28-b703-4aae-b4c4-3f39efc6b210",
      "description": "La conversation autour de l'IA et des grands modèles de langage (LLM) se concentre souvent sur les applications grand public, mais leur véritable pouvoir réside dans la transformation des opérations d'entreprise. Dans cette session, nous dépasserons la théorie pour nous plonger dans des cas d'utilisation pratiques et concrets de l'IA et des LLM au sein de la plateforme ServiceNow.",
      "shortDescription": "Découvrez comment l'IA et les LLM transforment les opérations d'entreprise, avec des cas d'utilisation pratiques de la plateforme ServiceNow, et pas seulement des applications grand public.",
      "speakerUUID": [
        "11bc74f2-75c1-4d59-a347-16ced19db81f"
      ],
      "tags": [
        "AI",
        "Gemini",
        "LLM",
        "Enterprise",
        "Web",
        "ServiceNow"
      ]
    },
    {
      "title": "Conférence #1",
      "uuid": "25547863-876f-4a20-9fb1-3df31b6be169",
      "description": "Conférence #1",
      "shortDescription": "Conférence #1",
      "speakerUUID": [],
      "tags": []
    },
    {
      "title": "IA agentique pour la modernisation des inventaires hérités : Construire un schéma de données universel",
      "uuid": "f4af3d18-5f08-44cf-b67e-4b688d7a28b8",
      "description": "Débloquez une transformation numérique transparente avec notre schéma de données universel et notre agent de migration alimenté par l'IA, standardisez et automatisez l'intégration des actifs, en fournissant des analyses en temps réel et un déclassement rapide des systèmes hérités, pérennisez vos opérations dès aujourd'hui !",
      "shortDescription": "Le schéma de données universel et l'agent IA automatisent l'intégration des actifs et les analyses pour une transformation numérique rapide.",
      "speakerUUID": [
        "6679e097-7eaf-443c-bc37-5348284dc517",
        "09770b99-ff7e-430f-9d26-bb752753613e"
      ],
      "tags": [
        "AI",
        "Agents",
        "Data",
        "Modernization",
        "Enterprise"
      ]
    },
    {
      "title": "À l'intérieur des frameworks de développement mobile",
      "uuid": "b5c2421b-e7b4-48f7-b0b1-befaf20c7d44",
      "description": "React Native, Flutter, .NET — comment fonctionnent-ils en coulisses ? Explorez les principes fondamentaux et les architectures qui permettent à ces frameworks de transformer du code multiplateforme en applications natives iOS et Android. Découvrez la magie derrière des fonctionnalités comme le rechargement à chaud, le code push et Gemini Nano.",
      "shortDescription": "Apprenez comment React Native, Flutter et .NET transforment une base de code unique en applications natives, et comment fonctionnent des fonctionnalités comme le rechargement à chaud.",
      "speakerUUID": [
        "1331b973-4f30-4f21-9942-072146e1713a"
      ],
      "tags": [
        "Android",
        "Mobile",
        "Flutter",
        "ReactNative",
        "iOS",
        "Gemini"
      ]
    },
    {
      "title": "Perfetto à petit budget : optimiser les performances d'Android sur du matériel bas de gamme",
      "uuid": "183e7f47-5a72-4cc4-b90f-89c2bb779c94",
      "description": "Les appareils bas de gamme présentent souvent les plus grands défis en matière de performances, où chaque cycle de processeur et chaque mégaoctet de mémoire comptent. Lorsque le profilage conventionnel échoue, Perfetto offre la visibilité système approfondie nécessaire pour diagnostiquer les goulots d'étranglement complexes, la pression excessive sur la mémoire ou les contentions d'E/S inattendues.",
      "shortDescription": "Perfetto aide à diagnostiquer les problèmes de performances sur les appareils bas de gamme lorsque le profilage normal échoue.",
      "speakerUUID": [
        "3130c533-0ac5-432d-b30c-922afa98ba64"
      ],
      "tags": [
        "Android",
        "Performance",
        "Mobile",
        "Debugging",
        "Perfetto"
      ]
    },
    {
      "title": "Smart Persona : Accélérer les informations sur les consommateurs avec des personas synthétiques",
      "uuid": "750ffce5-5eac-4df8-96c5-6dfc850fb158",
      "description": "Les applications d’IA modernes nécessitent des architectures robustes et fiables. Cette session explore la génération augmentée de récupération agentique (RAG) et la puissance des motifs de conception multinœuds pour améliorer les performances des grands modèles de langage. Nous utilisons un système de persona synthétique comme étude de cas complexe pour illustrer ces concepts. L’accent sera mis sur la méthodologie technique : comment utiliser des agents spécialisés pour des fonctions telles que la récupération de connaissances, la modélisation de traits et la génération de réponses. Les participants acquerront une compréhension approfondie des stratégies de mise en œuvre, des cadres d’orchestration et des meilleures pratiques essentielles pour construire et maintenir des solutions RAG multinœuds hautement cohérentes dans n’importe quel secteur.",
      "shortDescription": "Apprenez à construire une IA robuste avec Agentic RAG et des architectures multi-nœuds. Découvrez comment des agents spécialisés peuvent être orchestrés pour des tâches telles que la récupération de connaissances et la génération de réponses en utilisant des exemples concrets et les meilleures pratiques.",
      "speakerUUID": [
        "29b9deee-7ade-4ca8-b7e7-eb0fdd9d81a4"
      ],
      "tags": [
        "AI",
        "Personas",
        "UX",
        "Research",
        "Data"
      ]
    },
    {
      "title": "Interaction Homme-Machine : L'UX de l'IA",
      "uuid": "d12aa6ca-81ff-4123-989e-bf7d21ae7464",
      "description": "Cette conférence explore avec humour pourquoi la communication entre l'humain et l'IA représente un défi. En s'appuyant sur des exemples concrets de malentendus, elle démontre les limites du langage naturel et propose des pistes pour améliorer notre façon de communiquer avec l'IA.",
      "shortDescription": "Cette conférence, avec humour, montre les défis et malentendus de la communication entre humains et IA, et propose des idées pour mieux dialoguer avec l’intelligence artificielle.",
      "speakerUUID": [
        "5f8735c9-9ca8-42c3-b902-dfcd11dc9252"
      ],
      "tags": [
        "AI",
        "UX",
        "HCI",
        "Design",
        "NLP"
      ]
    },
    {
      "title": "Affinage de modèle en direct : Personnalisation de Gemma 3 270M en moins de 40 minutes",
      "uuid": "71f0abc9-de35-46dc-a93a-ca8420dd8213",
      "description": "Découvrez la puissance de l'IA accessible alors que nous affinons le nouveau modèle Gemma 3 270M de Google en direct sur scène en moins de 40 minutes. Cette démonstration se concentre sur la personnalisation post-entraînement, montrant comment un modèle pré-entraîné puissant peut être rapidement adapté à une tâche spécialisée. Pour y parvenir dans le temps imparti, nous utiliserons la vitesse et l'efficacité remarquables de la bibliothèque Unsloth pour l'affinage par réglage fin efficace des paramètres (PEFT) avec LoRA, le tout dans un environnement Google Colab standard. Il s'agit d'une démonstration pratique, étape par étape, sans diapositives — juste du code et des résultats.",
      "shortDescription": "Assistez à une démonstration en direct de l'affinage du modèle d'IA Gemma 3 270M de Google pour une tâche personnalisée en moins de 40 minutes — juste du code, sans diapositives — en utilisant Unsloth et LoRA dans Google Colab.",
      "speakerUUID": [
        "d86fde6f-7994-4fe5-821b-9e8b622f90c8"
      ],
      "tags": [
        "AI",
        "Gemma",
        "FineTuning",
        "LLM",
        "GenAI",
        "LiveDemo"
      ],
      "rsvpLink": "https://forms.gle/QyH9v2KXw9AL7cCE8",
      "rsvpButtonText": "S'inscrire ici"
    },
    {
      "title": "Atelier Kiosques Android (DiY) : Comment transformer un Raspberry Pi en un outil de travail modulaire",
      "uuid": "82294d89-8826-45aa-a965-4eafc71c5ec7",
      "description": "Que se passe-t-il si vous prenez un Raspberry Pi avec écran tactile, que vous y installez Android, et que vous le fixez sur un cube en aluminium 80/20 ? Vous obtenez un kiosque qui en fait bien plus que votre tablette verrouillée habituelle.\n\nJe vous montrerai comment construire votre propre système modulaire basé sur Android qui fonctionne parfaitement avec des périphériques USB auxquels vous ne vous attendriez pas : Pensez aux webcams et aux servomoteurs pour la numérisation 3D et la photographie automatisées.",
      "shortDescription": "Transformez un Raspberry Pi tactile sous Android fixé sur un cube 80/20 en kiosque polyvalent. Découvrez comment créer un système modulaire compatible avec des périphériques USB inattendus, comme des webcams et des servomoteurs, pour automatiser la numérisation 3D et la photographie.",
      "speakerUUID": [
        "d3c0ffd5-811d-4923-ba2d-f5a10c18cd7b"
      ],
      "tags": [
        "RaspberryPi",
        "Mobile",
        "Android",
        "3DScanning",
        "Photography"
      ]
    },
    {
      "title": "Construisez une IA pour le monde réel avec Gemma",
      "uuid": "0b5a7e21-636b-41b1-b7a5-56b12309f56a",
      "description": "Débloquez l'IA open source la plus puissante de Google ! Dans cet atelier, vous vous familiariserez avec la famille de modèles Gemma pour créer une application du monde réel, en apprenant à exécuter une IA puissante sur votre propre ordinateur portable.",
      "shortDescription": "Atelier pratique : créez de vraies applications avec les modèles d'IA Gemma de Google sur votre propre ordinateur portable.",
      "speakerUUID": [
        "bce0f861-ab51-4d08-8560-c1a942f11ced"
      ],
      "tags": [
        "AI",
        "Gemma",
        "Workshop",
        "LLM",
        "OpenSource"
      ],
      "rsvpLink": "https://forms.gle/c4Vz5rNfhNtMuB2D9",
      "rsvpButtonText": "S'inscrire ici"
    }
  ]
}

